import KioskKeyboard from 'kioskboard'

KioskKeyboard.init({
  language: 'ru',
  theme: 'light',
  keysArrayOfObjects: [
    {
      '0': 'Й',
      '1': 'Ц',
      '2': 'У',
      '3': 'К',
      '4': 'Е',
      '5': 'Н',
      '6': 'Г',
      '7': 'Ш',
      '8': 'Щ',
      '9': 'З',
      '10': 'Х',
      '11': 'Ъ',
    },
    {
      '0': 'Ф',
      '1': 'И',
      '2': 'В',
      '3': 'А',
      '4': 'П',
      '5': 'Р',
      '6': 'О',
      '7': 'Л',
      '8': 'Д',
      '9': 'Ж',
      '10': 'Э',
      '11': 'Я',
    },
    {
      '0': 'Ч',
      '1': 'С',
      '2': 'М',
      '3': 'И',
      '4': 'Т',
      '5': 'Ь',
      '6': 'Б',
      '7': 'Ю',
      '8': 'Ё',
      '9': 'Ь',
    },
  ],
})

export const keyboard = KioskKeyboard
